<?php

return [
    /*
    |--------------------------------------------------------------------------
    | Validation Language Lines
    |--------------------------------------------------------------------------
    */

    'email' => ':attributeは正しいメールアドレス形式で入力してください。',
    'required' => ':attributeを入力してください。',
    'min' => [
        'string' => ':attributeは:min文字以上で入力してください。',
    ],
    'confirmed' => ':attributeと一致しません。',

    /*
    |--------------------------------------------------------------------------
    | Custom Validation Language Lines
    |--------------------------------------------------------------------------
    */

    'custom' => [
        'login_identifier' => [
        'required' => 'ユーザー名またはメールアドレスを入力してください。',
        'string' => '入力が無効です。',
        'max' => '255文字以内で入力してください。',
        ],
        'password' => [
            'required' => 'パスワードを入力してください。',
            'min' => 'パスワードは8文字以上で入力してください。',
        ],
        'password_confirmation' => [
            'confirmed' => 'パスワードと一致しません。',
        ],
        'attributes' => [
            'email' => 'メールアドレス',
        ],
    ],

    /*
    |--------------------------------------------------------------------------
    | Custom Validation Attributes
    |--------------------------------------------------------------------------
    */

    'attributes' => [
        'name' => 'お名前',
        'email' => 'あメールアドレス',
        'login_identifier' => 'ユーザー名またはメールアドレス', // 追加
        'password' => 'パスワード',
        'password_confirmation' => '確認用パスワード',
    ],
];
